In [3]:
import numpy as np
import pandas as pd

# Uvoz in priprava podatkov

## PRIMER 1

### 1. Read csv file into a pandas dataframe

In [4]:
with open('data/DATA_DN_property data.csv') as f:
    f.read()

### 2. Take a look at the first 5 rows

In [5]:
df = pd.read_csv('data/DATA_DN_property data.csv')
df.head()

           PID  ST_NUM    ST_NAME OWN_OCCUPIED NUM_BEDROOMS  NUM_BATH SQ_FT
0  100001000.0   104.0     PUTNAM            Y            3       1.0  1000
1  100002000.0   197.0  LEXINGTON            N            3       1.5    --
2  100003000.0     NaN  LEXINGTON            N          NaN       1.0   850
3  100004000.0   201.0   BERKELEY           12            1       NaN   700
4          NaN   203.0   BERKELEY            Y            3       2.0  1600

### 3. Select and print the ST_NUM column

In [6]:
st_name = df.loc[:,"ST_NAME"]
st_name.head()

0       PUTNAM
1    LEXINGTON
2    LEXINGTON
3     BERKELEY
4     BERKELEY
Name: ST_NAME, dtype: object

### 4. Standard Missing Values: Check the misssing values in ST_NUM column with isnull() method

In [7]:
st_name.isnull()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
Name: ST_NAME, dtype: bool

### 5. Non-Standard Missing Values: Pandas didn't recognized the "--" and "na" as a missing value. in the NUM_BEDROOMS column. Try to detect these various missing values with the na_values parameter when importing the data with read_csv.

In [8]:
missing_values = ["n/a", "na", "--"]
df = pd.read_csv('data/DATA_DN_property data.csv', na_values = missing_values)
num_bedrooms = df.loc[:,"NUM_BEDROOMS"]
num_bedrooms.fillna(0)
num_bedrooms.loc[7,8] = 0
print(num_bedrooms.fillna(0))

0    3.0
1    3.0
2    0.0
3    1.0
4    3.0
5    0.0
6    2.0
7    0.0
8    0.0
Name: NUM_BEDROOMS, dtype: float64

/home/katja/anaconda3/lib/python3.7/site-packages/pandas/core/indexing.py:190: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._setitem_with_indexer(indexer, value)

### 6. Unexpected Missing Values

For example, if our feature is expected to be a string, but there’s a numeric type, then technically this is also a missing value.

#### Display the OWN_OCCUPIED column and it's missing values with isnull()

In [9]:
own_occupied = df.loc[:,"OWN_OCCUPIED"]
own_occupied

0      Y
1      N
2      N
3     12
4      Y
5      Y
6    NaN
7      Y
8      Y
Name: OWN_OCCUPIED, dtype: object

In [10]:
own_occupied.isnull()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
7    False
8    False
Name: OWN_OCCUPIED, dtype: bool

In the fourth row, there’s the number 12. The response for Owner Occupied should clearly be a string (Y or N), so this numeric type should be a missing value.

#### Write a loop to detect int values in the OWN_OCCUPIED column and count them

In [11]:
cnt=0
for row in df['OWN_OCCUPIED']:
    try:
        int(row)
        df.loc[cnt, 'OWN_OCCUPIED']=np.nan
    except ValueError:
        pass
    cnt+=1
    
print(df['OWN_OCCUPIED'].count())

7

### 7. Print the total number of missing values for each column.

In [12]:
df.count()

PID             8
ST_NUM          7
ST_NAME         9
OWN_OCCUPIED    7
NUM_BEDROOMS    7
NUM_BATH        8
SQ_FT           7
dtype: int64

### 8. Check to see if we have any missing values in the df at all in one line.

Hint: `.any()` method

In [13]:
df.any()

PID             True
ST_NUM          True
ST_NAME         True
OWN_OCCUPIED    True
NUM_BEDROOMS    True
NUM_BATH        True
SQ_FT           True
dtype: bool

### 9. Total count of missing values.

In [16]:
missing_values = ["n/a", "na", "--"]
print(df.isnull().sum().sum())

10

### 10. Replace missing values with a number 125 in the ST_NUM column

In [19]:
print (df['ST_NUM'])
print (df['ST_NUM'].isnull())

df.loc[2,'ST_NUM'] = 125
df
df.loc[6,'ST_NUM'] = 125
df

0    104.0
1    197.0
2    125.0
3    201.0
4    203.0
5    207.0
6      NaN
7    213.0
8    215.0
Name: ST_NUM, dtype: float64
0    False
1    False
2    False
3    False
4    False
5    False
6     True
7    False
8    False
Name: ST_NUM, dtype: bool

,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT
0,100001000.0,104.0,PUTNAM,Y,3.0,1.0,1000.0
1,100002000.0,197.0,LEXINGTON,N,3.0,1.5,NaN
2,100003000.0,125.0,LEXINGTON,N,NaN,1.0,850.0
3,100004000.0,201.0,BERKELEY,NaN,1.0,NaN,700.0
4,NaN,203.0,BERKELEY,Y,3.0,2.0,1600.0
5,100006000.0,207.0,BERKELEY,Y,NaN,1.0,800.0
6,100007000.0,125.0,WASHINGTON,NaN,2.0,2.0,950.0
7,100008000.0,213.0,TREMONT,Y,0.0,1.0,NaN
8,100009000.0,215.0,TREMONT,Y,0.0,2.0,1800.0

###  11. Replace missing values with a median value in the NUM_BEDROOMS column

In [21]:
median = df['NUM_BEDROOMS'].median()
df['NUM_BEDROOMS'].fillna(median, inplace=True)
df

,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT
0,100001000.0,104.0,PUTNAM,Y,3.0,1.0,1000.0
1,100002000.0,197.0,LEXINGTON,N,3.0,1.5,NaN
2,100003000.0,125.0,LEXINGTON,N,2.0,1.0,850.0
3,100004000.0,201.0,BERKELEY,NaN,1.0,NaN,700.0
4,NaN,203.0,BERKELEY,Y,3.0,2.0,1600.0
5,100006000.0,207.0,BERKELEY,Y,2.0,1.0,800.0
6,100007000.0,125.0,WASHINGTON,NaN,2.0,2.0,950.0
7,100008000.0,213.0,TREMONT,Y,0.0,1.0,NaN
8,100009000.0,215.0,TREMONT,Y,0.0,2.0,1800.0